import { TitleContent } from "components/global.styled";
import { ConteinerForList, List, Sentence1 } from "./addWork.styled";
import { TextList } from "./addWork.styled";

export default function WorkExplanation() {
    

    return (
        <> <TitleContent>Пояснення до ресурсів</TitleContent>
            <TextList>На вкладці "Довідник" ви можете знайти посилання на ресурси, за допомогою яких можна виконати додаткову роботу. Всі роботи виконуються в електроному вигляді</TextList>
            <ConteinerForList>
                <ul>
                    <List><Sentence1>Інтерактивні аркуші у Canva.</Sentence1>
                         <TextList>Для роботи потрібно зареєструватись на ресурсі Canva.</TextList>                      
                        <TextList>Для використання нажміть кнопку "змінити шаблон" після того як вдкриється ресурс за посиланням наданого завдання</TextList>
                        <TextList>При виконанні завдань вам потрібно вносити свої дані там де є знак питання. Для цього натискаємо на знак питання і над ним з'являється замочок - розблокувати. Натискаємо на нього і можна видаліти знак питання і написати своє.</TextList>
                        <TextList>Якщо випадково ви видалите знак питання і нічого не напишите, то текстове поле зникне. Тоді ліворуч на панелі потрібно взяти текст (літера Т) і створити текстове поле.</TextList>
                        <TextList>Щоб здати виконане завдання зверху праворуч натискаємо кнопку "поділитись", нижче обираємо зі списку "будь хто з посиланням", копіюємо посилання і прикріплюємо до виконаного завдання у класі.</TextList>
                    </List>
                    <List><Sentence1>Інтелект - карта.</Sentence1> 
                        <TextList>Інтелект - карта - це схема з певної теми.</TextList>
                        <TextList>Схему можна побудувати за допомогою додатку Coggle. Для цього:
                        відкриваємо гугл диск - створити - більше - підключити інші додатки.
                        Знаходимо додаток coggle - встановлюємо.
                        Тепер у списку "створити" є додаток для створення інтелект - карт.</TextList>
                        <TextList>Можна використовувати інші способи. Наприклад, за допомогою сервісу https://www.draw.io/ або розширення Mind Map</TextList>
                    </List>
                    <List><Sentence1>Відео.</Sentence1>                         
                        <TextList>Відео повинно містити 2 - 3 приклади задач з підвищенням складності, тобто від легких до більш складних. </TextList>
                        <TextList>Можна взяти і один приклад, якщо він великий або структурований (тобто за одним прикладом декілька питань) </TextList>
                    </List>
                    <List><Sentence1>Створення коміксів.</Sentence1>                         
                        <TextList>Посилання на ресурси, де можна створити комікси розміщені на вкладці "Довідник". 
                        Щоб не користуватися платною версією зробити скрин готової розробки.</TextList>
                        <TextList>Якщо ви самі малюєте комікси, то потрібно зробити один документ з фото коміксу. Тобто не кидаємо купу зображень, повинен бути один документ.</TextList>
                    </List>
                </ul>
            </ConteinerForList>
        </>
    )
}